Revit 2027 API
MEPSection.FixtureUnit Property
 The fixture unit of the section.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double FixtureUnit { get; }
Public ReadOnly Property FixtureUnit As Double
	Get
public:
property double FixtureUnit {
	double get ();
}
member FixtureUnit : float with get
Property Value
Double
Remarks
 In one section, all section members have same fixture unit. Fixture Unit is a number. The unit type is UT_Number.
See Also
Reference
MEPSection Class
Autodesk.Revit.DB.Mechanical Namespace